In [2]:
import pandas as pd
df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})

## group by
通过 groups 我们能获得分组之后的每一个group的分组，然后对于每个组的操作可以单独修改
### 通过groups查看分组的信息

In [3]:
groups = df.groupby(['AAA']).groups
groups

{1: [0, 2], 2: [1], 3: [3]}

### 通过循环对每个分组进行操作

In [4]:
groups = df.groupby("AAA")
for name, group in groups:
    print(name, "\n", group)

1
    AAA  BBB  CCC
0    1    1    2
2    1    2    3
2
    AAA  BBB  CCC
1    2    1    1
3
    AAA  BBB  CCC
3    3    2    1

### 通过 **idxmin** 或者 **first** 获取每组第一个元素

In [5]:
print(df)

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

通过idxmin获取的数据的series

In [6]:
print(type(df.groupby("BBB")['CCC'].idxmin()))
df.loc[df.groupby("BBB")['CCC'].idxmin()]

<class 'pandas.core.series.Series'>

   AAA  BBB  CCC
1    2    1    1
3    3    2    1

通过first获取每组第几条记录, 返回值依旧是series如果不加参数as_index=False 我们在前面加一个df.loc也可以达到同样的效果

In [7]:
df.loc[df.sort_values("CCC").groupby("BBB", as_index=True)['CCC'].first()]

   AAA  BBB  CCC
1    2    1    1
1    2    1    1

通过**head()** 也能达到同样的效果

In [8]:
df.loc[df.sort_values("CCC").groupby("BBB", as_index=False)['CCC'].head(1)]

   AAA  BBB  CCC
1    2    1    1
1    2    1    1

## apply 
apply 函数在dataframe中能对全部单元格的数值进行修改，可以传入匿名函数进行复杂操作

In [9]:
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

下面我们对于每一列数据进行归一化处理

In [10]:
df.apply(lambda x: (x-min(x))/(max(x)-min(x)))

   AAA  BBB  CCC
0  0.0  0.0  0.5
1  0.5  0.0  0.0
2  0.0  1.0  1.0
3  1.0  1.0  0.0

apply的参数**result_type**有三种选择：  
> expend:结果是一个list添加到列中  
> reduce：结果会是series  
> broadcast：保持原来的index和表结构不变，结果填进数据框中

In [11]:
print(df.apply(lambda x: (x-min(x))/(max(x)-min(x)), result_type='expand'))
print(df.apply(lambda x: (x-min(x))/(max(x)-min(x)), result_type='broadcast'))
print(df.apply(lambda x: (x-min(x))/(max(x)-min(x)), result_type='reduce'))

   AAA  BBB  CCC
0  0.0  0.0  0.5
1  0.5  0.0  0.0
2  0.0  1.0  1.0
3  1.0  1.0  0.0
   AAA  BBB  CCC
0    0    0    0
1    0    0    0
2    0    1    1
3    1    1    0
AAA    0    0.0
1    0.5
2    0.0
3    1.0
Name: AAA,...
BBB    0    0.0
1    0.0
2    1.0
3    1.0
Name: BBB,...
CCC    0    0.5
1    0.0
2    1.0
3    0.0
Name: CCC,...
dtype: object

## groupby+appely
group 后面加 apply能够对于每一组进行特殊处理，比如计算对每一组进行归一化

In [12]:
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [13]:
df['count'] = df.groupby('BBB')["CCC"].apply(lambda x: max(x)-x)
print(df)
# 列出每组BBB中count最大的AAA
df.groupby("BBB").apply(lambda x: x['AAA'].idxmax(x['count']))

   AAA  BBB  CCC  count
0    1    1    2      0
1    2    1    1      1
2    1    2    3      0
3    3    2    1      2

BBB
1    1
2    3
dtype: int64

## applymap
对数据框中的每一个数据进行操作。

In [14]:
df

   AAA  BBB  CCC  count
0    1    1    2      0
1    2    1    1      1
2    1    2    3      0
3    3    2    1      2

In [16]:
df.applymap(lambda x: x**2)

   AAA  BBB  CCC  count
0    1    1    4      0
1    4    1    1      1
2    1    4    9      0
3    9    4    1      4

## transform agg
transform输出的数据保持了原来的数据表的结构，agg输出的数据只是各个分组的计算出来的值。

In [17]:
df

   AAA  BBB  CCC  count
0    1    1    2      0
1    2    1    1      1
2    1    2    3      0
3    3    2    1      2

In [18]:
df.groupby("BBB")['AAA'].agg('sum')

BBB
1    3
2    4
Name: AAA, dtype: int64

In [19]:
df.groupby("BBB")['AAA'].transform("sum")

0    3
1    3
2    4
3    4
Name: AAA, dtype: int64

## pivot  
pivot(index, columns, values)  
index 构造出的新表的索引  
columns 构造出的新表的列名  
values 构造出新表的表格里的值  
数据透视表 long2wide

In [102]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

In [103]:
print(df, "\n")
print(df.pivot(index='bar', columns='foo', values='baz'))

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

foo  one  two
bar
A      1    4
B      2    5
C      3    6

## 长表转换成宽表
可以通过 wide_to_long 或者 melt 实现
### wide_to_long
- stubnames:匹配字段名前面的字符
- i：转成宽表后的值的列对应的名称
- j：转换的列的后面的值对应的名称
- sep：分隔符
- suffix：前缀

In [117]:
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [119]:
df_pivot = df.pivot(index='bar', columns=['foo', 'zoo'], values='baz')
df_pivot

foo  one            two
zoo    x    y    z    q    w    t
bar
A    1.0  NaN  NaN  4.0  NaN  NaN
B    NaN  2.0  NaN  NaN  5.0  NaN
C    NaN  NaN  3.0  NaN  NaN  6.0

In [123]:
df_pivot.unstack(0)

foo  zoo  bar
one  x    A      1.0
          B      NaN
          C      NaN
     y    A      NaN
          B      2.0
          C      NaN
     z    A      NaN
          B      NaN
          C      3.0
two  q    A      4.0
          B      NaN
          C      NaN
     w    A      NaN
          B      5.0
          C      NaN
     t    A      NaN
          B      NaN
          C      6.0
dtype: float64

In [106]:
df_pivot.columns = [x+"-"+y for x, y in df_pivot.columns]

In [107]:
df_pivot.reset_index(drop=False, inplace=True)
df_pivot.drop('bar', axis=1, inplace=True)

In [108]:
df_pivot['id'] = list(range(1, df_pivot.shape[0]+1))
df_pivot

   one-x  one-y  one-z  two-q  two-w  two-t  id
0    1.0    NaN    NaN    4.0    NaN    NaN   1
1    NaN    2.0    NaN    NaN    5.0    NaN   2
2    NaN    NaN    3.0    NaN    NaN    6.0   3

In [116]:
pd.wide_to_long(df_pivot, ['two', 'one'], i='id', j='foo', sep="-")

Empty DataFrame
Columns: [two-t, two-w, one-x, one-z, one-y, two-q, two, one]
Index: []

In [113]:
import numpy as np
np.random.seed(0)
df_sample = pd.DataFrame({'A(weekly)-2010': np.random.rand(3),
                   'A(weekly)-2011': np.random.rand(3),
                   'B(weekly)-2010': np.random.rand(3),
                   'B(weekly)-2011': np.random.rand(3),
                   'X' : np.random.randint(3, size=3)})
df_sample['id'] = df_sample.index
df_sample

   A(weekly)-2010  A(weekly)-2011  B(weekly)-2010  B(weekly)-2011  X  id
0        0.548814        0.544883        0.437587        0.383442  0   0
1        0.715189        0.423655        0.891773        0.791725  1   1
2        0.602763        0.645894        0.963663        0.528895  1   2

In [98]:
pd.wide_to_long(df_sample, ['A(weekly)', 'B(weekly)'], i='id', j='year', sep='-')

         X  A(weekly)  B(weekly)
id year
0  2010  0   0.548814   0.437587
1  2010  1   0.715189   0.891773
2  2010  1   0.602763   0.963663
0  2011  0   0.544883   0.383442
1  2011  1   0.423655   0.791725
2  2011  1   0.645894   0.528895

melt使用

In [109]:
pd.melt(df_pivot, id_vars=['id'], value_vars=['one-x','one-y','one-z','two-q','two-w','two-t'])

    id variable  value
0    1    one-x    1.0
1    2    one-x    NaN
2    3    one-x    NaN
3    1    one-y    NaN
4    2    one-y    2.0
5    3    one-y    NaN
6    1    one-z    NaN
7    2    one-z    NaN
8    3    one-z    3.0
9    1    two-q    4.0
10   2    two-q    NaN
11   3    two-q    NaN
12   1    two-w    NaN
13   2    two-w    5.0
14   3    two-w    NaN
15   1    two-t    NaN
16   2    two-t    NaN
17   3    two-t    6.0